{
  "_name_or_path": "google/vit-base-patch16-224-in21k",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "finetuning_task": "image-classification",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Acacia_tortilis",
    "1": "Amaranthus",
    "10": "Helianthus_annuus",
    "11": "Lavandula_angustifolia",
    "12": "Liliaceae",
    "13": "Malvaceae",
    "14": "Medicago",
    "15": "Myrtus",
    "16": "NotPollen",
    "17": "Poaceae",
    "18": "Prosopis_sp",
    "19": "Starch",
    "2": "Arecaceae",
    "20": "Taraxacum",
    "21": "Terminalia_arjuna",
    "22": "Unfocused",
    "23": "Unknown2",
    "24": "Urticaceae",
    "25": "Ziziphus_spina-christi_Var",
    "3": "Brassica",
    "4": "Cyperaceae",
    "5": "Eucalyptus_sp",
    "6": "Fabaceae",
    "7": "Fagus",
    "8": "Fragaria",
    "9": "HDE"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Acacia_tortilis": "0",
    "Amaranthus": "1",
    "Arecaceae": "2",
    "Brassica": "3",
    "Cyperaceae": "4",
    "Eucalyptus_sp": "5",
    "Fabaceae": "6",
    "Fagus": "7",
    "Fragaria": "8",
    "HDE": "9",
    "Helianthus_annuus": "10",
    "Lavandula_angustifolia": "11",
    "Liliaceae": "12",
    "Malvaceae": "13",
    "Medicago": "14",
    "Myrtus": "15",
    "NotPollen": "16",
    "Poaceae": "17",
    "Prosopis_sp": "18",
    "Starch": "19",
    "Taraxacum": "20",
    "Terminalia_arjuna": "21",
    "Unfocused": "22",
    "Unknown2": "23",
    "Urticaceae": "24",
    "Ziziphus_spina-christi_Var": "25"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.3"
}
